In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = {'Country':['Belgium','India','Brazil'], 
       'Capital':['Brussels','New Delhi','Brasilia'],
       'Population':[11190846,1303171035,207847528]}

In [3]:
data

{'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Country': ['Belgium', 'India', 'Brazil'],
 'Population': [11190846, 1303171035, 207847528]}

Series

In [8]:
s1 = pd.Series(data['Country'], index=['a','b','c'])

In [9]:
s1

a    Belgium
b      India
c     Brazil
dtype: object

In [10]:
s1.values

array(['Belgium', 'India', 'Brazil'], dtype=object)

In [11]:
s1.index

Index(['a', 'b', 'c'], dtype='object')

DataFrame

In [12]:
df1 = pd.DataFrame(data)

In [13]:
df1

     Capital  Country  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847528

In [14]:
df1['Country']

0    Belgium
1      India
2     Brazil
Name: Country, dtype: object

In [15]:
df1.iterrows()

In [26]:
# 执行for循环操作
for row in df1.iterrows():
    print(row), print(type(row)),print(len(row))
    break

(0, Capital       Brussels
Country        Belgium
Population    11190846
Name: 0, dtype: object)
<class 'tuple'>
2

In [31]:
# 以下输出表示dataframe是由多个series组成
for row in df1.iterrows():
    print(type(row[0])), print(type(row[1]))
    break

<class 'numpy.int64'>
<class 'pandas.core.series.Series'>

In [33]:
data

{'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Country': ['Belgium', 'India', 'Brazil'],
 'Population': [11190846, 1303171035, 207847528]}

In [40]:
# 通过series创建dataframe
s_1 = pd.Series(data['Capital'])

In [41]:
s_2 = pd.Series(data['Country'])

In [42]:
s_3 = pd.Series(data['Population'])

In [54]:
df_new = pd.DataFrame([s_1,s_2,s_3], index=['Capital', 'Country', 'Population'])

In [55]:
df_new = df_new.T

In [56]:
df_new

     Capital  Country  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847528

In [57]:
df1

     Capital  Country  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847528